"use client";

export default function DeliveryPayment() {
  return (
    <div className="text-white pt-24 pr-24 pl-24 flex flex-col gap-8">
      <div>
        <p>
          <strong>Доставка і оплата</strong>
        </p>
      </div>
      <div>
        <p>💳 Оплата Оплату можна здійснити такими способами: </p>
        <p>
          • Банківськими картками VISA / Mastercard безпосередньо на сайті під
          час оформлення замовлення;
        </p>
        <p> • За допомогою сервісів Google Pay або Apple Pay. </p>
      </div>
      <div>
        <p>🚚 Доставка </p>
        <p>
          • Онлайн-товари надсилаються на електронну пошту, вказану під час
          реєстрації.
        </p>
        <p>• Фізичні товари доставляються через службу доставки «Нова пошта»</p>
      </div>
      <div>
        <p>
          <strong>Термін доставки:</strong>
        </p>
        <p>
          Орієнтовний час очікування — від 1 до 3 робочих днів У разі
          підвищеного навантаження на менеджера — до 5 робочих днів
        </p>
      </div>
    </div>
  );
}
