"use client";

export default function PublicOffer() {
  return (
    <div className="text-white pt-24 pr-24 pl-24 flex flex-col gap-8">
      <div>
        ПУБЛІЧНА ОФЕРТА про укладення договору купівлі-продажу товарів
        дистанційним способом Власник сайту:
      </div>
      <div>
        <p>ФОП СОКОЛОВ ВАЛЕРІЙ ГРИГОРОВИЧ</p>
        <p>ІПН (РНОКПП): 3473301092 </p>
        <p> Веб-сайт: «https://automerch.com.ua/» </p>
        <p>Електронна пошта: eldopolz690@gmail.com</p>
        <p> Телефон: +380936018962</p>
      </div>
      <div>
        <p>
          <strong> 1. </strong> Загальні положення
        </p>
        <p>
          <strong>1.1. </strong> Цей документ є офіційною публічною пропозицією
          (далі — «Оферта») ФОП [ПІБ], надалі — «Продавець», укласти договір
          купівлі-продажу товарів з будь-якою фізичною або юридичною особою, яка
          приймає умови цієї Оферти (далі — «Покупець»).
        </p>
        <p>
          <strong>1.2. </strong>
          Відповідно до статей 633, 641, 642 Цивільного кодексу України ця
          Оферта є публічною, а її умови — однаковими для всіх Покупців.
        </p>
        <p>
          {" "}
          <strong>1.3. </strong> Факт оформлення замовлення на сайті
          «https://automerch.com.ua/» означає повну і безумовну згоду Покупця з
          усіма умовами цієї Оферти без необхідності підписання письмового
          договору.
        </p>
      </div>
      <div>
        <p>
          <strong>2. </strong>Предмет договору
        </p>
        <p>
          <strong>2.1. </strong> Продавець зобов’язується передати у власність
          Покупцю товари (фізичні чи цифрові), представлені на сайті, а Покупець
          зобов’язується прийняти товар і оплатити його на умовах цієї Оферти.
        </p>
        <p>
          <strong>2.2. </strong> Асортимент, характеристики та ціни товарів
          визначаються на сайті «https://automerch.com.ua/» на момент оформлення
          замовлення.
        </p>
      </div>
      <div>
        <p>
          <strong>3. </strong>Момент укладення договору
        </p>
        <p>
          <strong>3.1. </strong> Договір вважається укладеним із моменту, коли
          Покупець: • натискає кнопку «Оформити замовлення» або «Купити», та •
          здійснює оплату через платіжні сервіси (LiqPay, WayForPay, Monobank,
          Privat24 тощо).
        </p>
        <p>
          <strong>3.2. </strong>Після успішної оплати на вказану електронну
          пошту Покупця надсилається підтвердження замовлення або посилання на
          отримання цифрового товару.
        </p>
      </div>
      <div>
        <p>
          <strong>4. </strong> Права та обов’язки сторін{" "}
        </p>
        <p>
          {" "}
          <strong>Продавець зобов’язується:</strong>
        </p>
        <p>
          {" "}
          • надати достовірну інформацію про товари, їх характеристики, ціну та
          спосіб оплати;
        </p>
        <p> • передати Покупцю оплачений товар у встановлений термін;</p>
        <p>
          • забезпечити захист персональних даних Покупця згідно із Законом
          України «Про захист персональних даних».
        </p>
        <p>
          <strong>Покупець зобов’язується: </strong>
        </p>
        <p> • надати достовірні дані при оформленні замовлення;</p>
        <p>• своєчасно оплатити товар;</p>
        <p>
          • перевірити комплектність і зовнішній вигляд товару при отриманні.
        </p>{" "}
      </div>
      <div>
        <p>
          <strong>5. </strong>Ціна та порядок оплати
        </p>
        <p>
          <strong>5.1. </strong> Ціни на товари вказані на сайті у гривнях з
          урахуванням усіх податків.
        </p>
        <p>
          <strong>5.2. </strong> Оплата здійснюється 100% авансом через
          банківські сервіси або онлайн-еквайринг.
        </p>
        <p>
          <strong>5.3. </strong> У разі зміни ціни після оформлення замовлення
          діє ціна, актуальна на момент підтвердження замовлення Покупцем.
        </p>
        <p>
          <strong>5.4. </strong> Платежі обробляються через захищені платіжні
          сервіси, тому реквізити банківських карток не зберігаються на сайті.
        </p>
      </div>
      <div>
        <p>
          <strong>6. </strong>Доставка та передача товару{" "}
        </p>
        <p>
          <strong>6.1. </strong>
          Доставка фізичних товарів здійснюється через поштові або кур’єрські
          служби («Нова пошта», «Укрпошта» тощо).
        </p>
        <p>
          <strong>6.2. </strong>Цифрові товари (електронні курси, підписки)
          надаються у вигляді посилань або електронних файлів після оплати.{" "}
        </p>
        <p>
          <strong>6.3. </strong>Термін доставки визначається згідно з умовами
          обраного перевізника.
        </p>
      </div>
      <div>
        <p>
          <strong>7. </strong>Повернення та обмін{" "}
        </p>
        <p>
          <strong>7.1. </strong>Повернення або обмін фізичних товарів
          здійснюється згідно із Законом України «Про захист прав споживачів».
        </p>
        <p>
          <strong>7.2. </strong>Повернення цифрових товарів (курсів, підписок)
          після отримання посилання на завантаження не здійснюється, оскільки це
          прирівнюється до «факту передачі послуги».{" "}
        </p>
        <p>
          <strong>7.3. </strong>Якщо товар має технічний дефект або Покупець не
          отримав доступ після оплати — Продавець зобов’язується надати повторну
          відправку або індивідуальне рішення.
        </p>
      </div>
      <div>
        <p>
          <strong>8. </strong>Відповідальність сторін{" "}
        </p>
        <p>
          <strong>8.1. </strong>Сторони несуть відповідальність згідно із
          законодавством України.
        </p>
        <p>
          <strong>8.2. </strong>Продавець не несе відповідальності за некоректно
          вказані дані Покупцем або перебої в роботі платіжних систем чи
          поштових служб.
        </p>
        <p>
          <strong>8.3.</strong>Продавець не несе відповідальності за дії третіх
          осіб, які надають платіжні чи поштові послуги.
        </p>
      </div>
      <div>
        <p>
          <strong>9. </strong>Обробка персональних даних
        </p>
        <p>
          <strong>9.1. </strong>При оформленні замовлення Покупець надає згоду
          на обробку своїх персональних даних відповідно до Політики
          конфіденційності, опублікованої на сайті.
        </p>
        <p>
          <strong>9.2. </strong>Продавець використовує ці дані виключно для
          виконання договору (оформлення, оплата, доставка, зворотний зв’язок).
        </p>
      </div>
      <div>
        <p>
          <strong>10. </strong>Інші умови
        </p>
        <p>
          <strong>10.1. </strong>Сайт може тимчасово призупиняти роботу для
          оновлень або технічного обслуговування.
        </p>
        <p>
          <strong>10.2. </strong>Продавець має право змінювати умови Оферти без
          попереднього повідомлення.
        </p>
      </div>
    </div>
  );
}
