"use client";

export default function PrivacyPolicy() {
  return (
    <div className="text-white pt-24 pr-24 pl-24 flex flex-col gap-8">
      <div>
        <strong>Політика конфіденційності</strong>
      </div>
      <div>
        <p>Власник сайту: ФОП СОКОЛОВ ВАЛЕРІЙ ГРИГОРОВИЧ</p>
        <p>Адреса сайту: https://automerch.com.ua/</p>
      </div>
      <div>
        <p>
          <strong>1. </strong>Загальні положення Ця Політика конфіденційності
          визначає порядок збору, використання та захисту персональних даних
          користувачів сайту …. (далі – «Сайт»). Ми поважаємо право користувачів
          на конфіденційність та гарантуємо захист їхніх персональних даних
          відповідно до Закону України «Про захист персональних даних».
        </p>
      </div>
      <div>
        <p>
          <strong>2. </strong>Збір персональних даних Ми можемо збирати такі
          дані користувачів:
        </p>
        <p> • Ім’я, прізвище (за бажанням);</p>
        <p> • Адресу електронної пошти;</p>
        <p> • Номер телефону;</p>
        <p>
          {" "}
          • Дані для оплати (не зберігаються на сайті — обробляються через
          платіжні сервіси, наприклад LiqPay, WayForPay тощо);{" "}
        </p>
        <p>
          {" "}
          • Інформацію про дії на сайті (cookies, IP-адресу, дані браузера
          тощо).
        </p>
      </div>
      <div>
        <p>
          <strong>3. </strong>Мета обробки персональних даних Персональні дані
          збираються для:
        </p>
        <p> • оформлення замовлень та оплати;</p>
        <p>
          {" "}
          • надання доступу до цифрових товарів (стікерів, підписок, курсів
          тощо);
        </p>
        <p> • зворотного зв’язку з клієнтами;</p>
        <p> • надсилання новин, акцій, оновлень (за згодою користувача);</p>
        <p> • аналітики роботи сайту для покращення сервісу.</p>
      </div>
      <div>
        <p>
          <strong>4. </strong>Використання файлів cookie Сайт може
          використовувати cookie-файли для:
        </p>
        <p> • зберігання налаштувань користувача;</p>
        <p> • аналітики трафіку через Google Analytics або Meta Pixel;</p>
        <p>
          {" "}
          • персоналізації контенту. Користувач може відключити cookie у
          налаштуваннях браузера.
        </p>
      </div>
      <div>
        <p>
          <strong>5. </strong>Передача даних третім особам Ми не передаємо
          персональні дані третім особам, крім випадків:
        </p>
        <p>
          {" "}
          • коли це необхідно для обробки платежів або доставки (наприклад,
          банкам, платіжним системам);
        </p>
        <p> • коли цього вимагає законодавство України.</p>
      </div>
      <div>
        <p>
          <strong>6. </strong>Захист персональних даних Ми використовуємо
          сучасні технічні та організаційні заходи безпеки для захисту
          персональних даних від несанкціонованого доступу, втрати чи
          розголошення.
        </p>
      </div>
      <div>
        <p>
          <strong>7. </strong>Права користувача Користувач має право:
        </p>
        <p> • знати, які дані про нього зберігаються;</p>
        <p> • вимагати виправлення або видалення своїх персональних даних;</p>
        <p> • відкликати згоду на їх обробку;</p>
        <p>
          • звертатися зі скаргою до Уповноваженого Верховної Ради України з
          прав людини. Для реалізації своїх прав користувач може звертатися за
          адресою: 📧 [твоя email-адреса для звернень, наприклад info@.com.ua]
        </p>
      </div>
      <div>
        <p>
          <strong>8. </strong>Зміни до Політики конфіденційності Ми можемо
          періодично оновлювати цю Політику. Усі зміни будуть опубліковані на
          цій сторінці із зазначенням дати оновлення.
        </p>
      </div>
      <div>
        <p>
          <strong>9. </strong>Контактна інформація Власник сайту:
        </p>
        <p>ФОП СОКОЛОВ ВАЛЕРІЙ ГРИГОРОВИЧ</p>
        <p>РНОКПП (ІПН): 3473301092</p>
        <p>
          Адреса реєстрації: Україна, 51610, Дніпропетровська обл., Кам'янський
          р-н, село Мишурин Ріг, вулиця Механізаторів, будинок 10
        </p>
        <p>Електронна пошта: eldopolz690@gmail.com Телефон: +380936018962</p>
      </div>
    </div>
  );
}
